<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <title>daidai</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta property="og:type" content="website">
<meta property="og:title" content="daidai">
<meta property="og:url" content="http://example.com/page/10/index.html">
<meta property="og:site_name" content="daidai">
<meta property="og:locale" content="en_US">
<meta property="article:author" content="daidai">
<meta name="twitter:card" content="summary">
  
    <link rel="alternate" href="/atom.xml" title="daidai" type="application/atom+xml">
  
  
    <link rel="shortcut icon" href="/favicon.png">
  
  
    
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/typeface-source-code-pro@0.0.71/index.min.css">

  
  
<link rel="stylesheet" href="/css/style.css">

  
    
<link rel="stylesheet" href="/fancybox/jquery.fancybox.min.css">

  
<meta name="generator" content="Hexo 6.3.0"></head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">daidai</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        

<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span><span class="string">&lt;bits/stdc++.h&gt;</span></span></span><br><span class="line"><span class="keyword">using</span> <span class="keyword">namespace</span>  std;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">point2</span> &#123;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">pfunc</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="type">int</span> a, b;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;class point2	size(12):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| a</span></span><br><span class="line"><span class="comment">1&gt; 8	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;point2::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;point2_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point2::pfunc</span></span><br><span class="line"><span class="comment">1&gt;point2::pfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">point3</span> : <span class="keyword">public</span> point2</span><br><span class="line">&#123;</span><br><span class="line">    <span class="function"><span class="type">void</span> <span class="title">pfunc</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;</span><br><span class="line">    <span class="type">int</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class point3	size(16):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| +--- (base class point2)</span></span><br><span class="line"><span class="comment">1&gt; 0	| | &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| | a</span></span><br><span class="line"><span class="comment">1&gt; 8	| | b</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt;12	| c</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;point3::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;point3_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point3::pfunc</span></span><br><span class="line"><span class="comment">1&gt;point3::pfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">vertex</span> &#123;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">vfunc</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class vertex	size(4):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;vertex::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;vertex_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;vertex::vfunc</span></span><br><span class="line"><span class="comment">1&gt;vertex::vfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">v3d</span> : <span class="keyword">public</span> point3, <span class="keyword">public</span> vertex &#123;</span><br><span class="line">    <span class="type">int</span> d, f;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class v3d	size(28):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| +--- (base class point3)</span></span><br><span class="line"><span class="comment">1&gt; 0	| | +--- (base class point2)</span></span><br><span class="line"><span class="comment">1&gt; 0	| | | &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| | | a</span></span><br><span class="line"><span class="comment">1&gt; 8	| | | b</span></span><br><span class="line"><span class="comment">1&gt;	| | +---</span></span><br><span class="line"><span class="comment">1&gt;12	| | c</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt;16	| +--- (base class vertex)</span></span><br><span class="line"><span class="comment">1&gt;16	| | &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt;20	| d</span></span><br><span class="line"><span class="comment">1&gt;24	| f</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;v3d::$vftable@point3@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;v3d_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point3::pfunc</span></span><br><span class="line"><span class="comment">1&gt;v3d::$vftable@vertex@:</span></span><br><span class="line"><span class="comment">1&gt;	| -16</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;vertex::vfunc</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">    <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>


<h2 id="虚析构函数"><a href="#虚析构函数" class="headerlink" title="虚析构函数"></a>虚析构函数</h2><p>虚析构函数的主要作用是防止内存泄露。</p>
<p>定义一个<em>基类的指针p</em>，在delete p时，如果基类的析构函数是虚函数，这时只会看p所赋值的对象，如果p赋值的对象是派生类的对象，就会调用派生类的析构函数（毫无疑问，在这之前也会先调用基类的构造函数，在调用派生类的构造函数，然后调用派生类的析构函数，基类的析构函数，所谓先构造的后释放）；如果p赋值的对象是基类的对象，就会调用基类的析构函数，这样就不会造成内存泄露。</p>
<p>如果基类的析构函数不是虚函数，在delete p时，调用析构函数时，会进行静态绑定，<em>只会看指针的数据类型</em>，而不会去看赋值的对象，这样就会造成内存泄露。</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span><span class="string">&lt;iostream&gt;</span></span></span><br><span class="line"><span class="keyword">using</span> <span class="keyword">namespace</span> std;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">base</span>&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="comment">// virtual </span></span><br><span class="line">    ~<span class="built_in">base</span>()&#123;</span><br><span class="line">        cout&lt;&lt;<span class="string">&quot;base&quot;</span>&lt;&lt;endl;</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">derived</span> : <span class="keyword">public</span> base &#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    ~<span class="built_in">derived</span>()&#123;</span><br><span class="line">        cout&lt;&lt;<span class="string">&quot;derived&quot;</span>&lt;&lt;endl;</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span></span>&#123;</span><br><span class="line">    base * p = <span class="keyword">new</span> derived;</span><br><span class="line">    <span class="keyword">delete</span> p;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<h2 id="没有多态，则静态绑定-x3D-gt-call-xxx"><a href="#没有多态，则静态绑定-x3D-gt-call-xxx" class="headerlink" title="没有多态，则静态绑定 &#x3D;&gt; call xxx"></a>没有多态，则静态绑定 &#x3D;&gt; call xxx</h2><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span><span class="string">&lt;iostream&gt;</span></span></span><br><span class="line"><span class="keyword">using</span> <span class="keyword">namespace</span> std;</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">A</span>&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="function"><span class="type">void</span> <span class="title">func</span><span class="params">()</span></span>&#123;</span><br><span class="line">        cout&lt;&lt;<span class="string">&quot;func&quot;</span>&lt;&lt;endl;</span><br><span class="line">    &#125;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">func2</span><span class="params">()</span></span>&#123;</span><br><span class="line">        cout&lt;&lt;<span class="string">&quot;func2&quot;</span>&lt;&lt;endl;</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line">    A *a = <span class="literal">nullptr</span>;</span><br><span class="line">    a-&gt;<span class="built_in">func</span>();</span><br><span class="line">    <span class="comment">// a-&gt;func2();</span></span><br><span class="line">    <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>


<h2 id="构造与析构的多态"><a href="#构造与析构的多态" class="headerlink" title="构造与析构的多态"></a>构造与析构的多态</h2><p>关于构造函数可以是虚函数的问题，虚函数是通过虚函数表来实现的，而虚函数表是在对象的构造函数中初始化的。也就是说，在对象构造过程中，<em>虚函数表还没有被初始化</em>，因此虚函数的调用不能按照多态的方式进行。</p>
<p>其次，对于析构函数中调用虚函数的问题，虚函数机制在析构函数中依然可以正常工作。由于在对象析构时，其<em>派生类的部分已经被销毁，因此派生类的虚函数将无法被调用</em>。但是基类中的虚函数依然可以被正确地调用。</p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span><span class="string">&lt;iostream&gt;</span></span></span><br><span class="line"><span class="keyword">using</span> <span class="keyword">namespace</span> std;</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">base</span>&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">func</span><span class="params">()</span></span>&#123;</span><br><span class="line">        cout&lt;&lt; <span class="string">&quot;base\n&quot;</span>;</span><br><span class="line">    &#125;</span><br><span class="line">    <span class="keyword">virtual</span> ~<span class="built_in">base</span>()&#123;</span><br><span class="line">        <span class="built_in">func</span>();</span><br><span class="line">    &#125;</span><br><span class="line">    <span class="function"><span class="type">void</span> <span class="title">doit</span><span class="params">()</span></span>&#123;</span><br><span class="line">        <span class="built_in">func</span>();</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">derived</span>:<span class="keyword">public</span> base&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">func</span><span class="params">()</span></span>&#123;</span><br><span class="line">        cout&lt;&lt; <span class="string">&quot;derived\n&quot;</span>;</span><br><span class="line">    &#125;</span><br><span class="line">    <span class="keyword">virtual</span> ~<span class="built_in">derived</span>()&#123;</span><br><span class="line">        <span class="built_in">func</span>();</span><br><span class="line">    &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span></span>&#123;</span><br><span class="line"></span><br><span class="line">    base * p = <span class="keyword">new</span> derived;</span><br><span class="line">    p -&gt; <span class="built_in">doit</span>();</span><br><span class="line">    p -&gt; <span class="built_in">func</span>();</span><br><span class="line">    <span class="keyword">delete</span> p;</span><br><span class="line"></span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>





      
    </div>
    <footer class="article-footer">
      <a data-url="http://example.com/2023/05/66baa7899bad.html" data-id="clhh52sbz005w4sai6iiu3tme" data-title="多态" class="article-share-link">Share</a>
      
      
      
    </footer>
  </div>
  
</article>



  
    <article id="post-cpp/class/封装" class="h-entry article article-type-post" itemprop="blogPost" itemscope itemtype="https://schema.org/BlogPosting">
  <div class="article-meta">
    <a href="/2023/05/ffc3a204ebbf.html" class="article-date">
  <time class="dt-published" datetime="2023-05-08T02:33:55.000Z" itemprop="datePublished">2023-05-08</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/note/">note</a>►<a class="article-category-link" href="/categories/note/cpp/">cpp</a>►<a class="article-category-link" href="/categories/note/cpp/class/">class</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="p-name article-title" href="/2023/05/ffc3a204ebbf.html">封装</a>
    </h1>
  

      </header>
    
    <div class="e-content article-entry" itemprop="articleBody">
      
        <p>c++ 自己的数据用自己的函数来处理 &#x3D;&gt; 数据和函数包在一起。<br>数据可以有很多份 ，函数只有一份，所有成员函数都带一个隐藏的参数 –&gt;  this指针 。</p>
<p>封装<em>non-static 成员变量</em></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://example.com/2023/05/ffc3a204ebbf.html" data-id="clhh52sbz005y4saidq9o6m0x" data-title="封装" class="article-share-link">Share</a>
      
      
      
    </footer>
  </div>
  
</article>



  
    <article id="post-cpp/class/虚继承" class="h-entry article article-type-post" itemprop="blogPost" itemscope itemtype="https://schema.org/BlogPosting">
  <div class="article-meta">
    <a href="/2023/05/e2eee6ca11bf.html" class="article-date">
  <time class="dt-published" datetime="2023-05-08T02:33:55.000Z" itemprop="datePublished">2023-05-08</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/note/">note</a>►<a class="article-category-link" href="/categories/note/cpp/">cpp</a>►<a class="article-category-link" href="/categories/note/cpp/class/">class</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="p-name article-title" href="/2023/05/e2eee6ca11bf.html">虚继承</a>
    </h1>
  

      </header>
    
    <div class="e-content article-entry" itemprop="articleBody">
      
        <p>虚拟继承状态下，base  class 不管在继承串联中被派生多少次，永远只会存在一个实例</p>
<p>virtual base class 运用形式 ： 一个抽象的virtual base class 没有任何data member用作接口</p>
<p><em>类中有vbptr ,指向 vbtable , vbtable 中存放对应的偏移量</em></p>
<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span><span class="string">&lt;bits/stdc++.h&gt;</span></span></span><br><span class="line"><span class="keyword">using</span> <span class="keyword">namespace</span>  std;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">point2</span> &#123;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">pfunc</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="type">int</span> a, b;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class point2	size(12):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| a</span></span><br><span class="line"><span class="comment">1&gt; 8	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;point2::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;point2_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point2::pfunc</span></span><br><span class="line"><span class="comment">1&gt;point2::pfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">point3</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> point2</span><br><span class="line">&#123;</span><br><span class="line">    <span class="function"><span class="type">void</span> <span class="title">pfunc</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;</span><br><span class="line">    <span class="type">int</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class point3	size(20):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vbptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| c</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base point2)</span></span><br><span class="line"><span class="comment">1&gt; 8	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;12	| a</span></span><br><span class="line"><span class="comment">1&gt;16	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;point3::$vbtable@:</span></span><br><span class="line"><span class="comment">1&gt; 0	| 0</span></span><br><span class="line"><span class="comment">1&gt; 1	| 8 (point3d(point3+0)point2)</span></span><br><span class="line"><span class="comment">1&gt;point3::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| -8</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point3::pfunc</span></span><br><span class="line"><span class="comment">1&gt;point3::pfunc this adjustor: 8</span></span><br><span class="line"><span class="comment">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span></span><br><span class="line"><span class="comment">1&gt;          point2       8       0       4 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">vertex</span> &#123;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">vfunc</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class vertex	size(4):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;vertex::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;vertex_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;vertex::vfunc</span></span><br><span class="line"><span class="comment">1&gt;vertex::vfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">v3d</span> : <span class="keyword">public</span> point3, <span class="keyword">public</span> vertex &#123;</span><br><span class="line">    <span class="type">int</span> d, f;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">    <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class v3d	size(32):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| +--- (base class vertex)</span></span><br><span class="line"><span class="comment">1&gt; 0	| | &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt; 4	| +--- (base class point3)</span></span><br><span class="line"><span class="comment">1&gt; 4	| | &#123;vbptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 8	| | c</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt;12	| d</span></span><br><span class="line"><span class="comment">1&gt;16	| f</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base point2)</span></span><br><span class="line"><span class="comment">1&gt;20	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;24	| a</span></span><br><span class="line"><span class="comment">1&gt;28	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">1&gt;v3d::$vftable@vertex@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;v3d_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;vertex::vfunc</span></span><br><span class="line"><span class="comment">1&gt;v3d::$vbtable@:</span></span><br><span class="line"><span class="comment">1&gt; 0	| 0</span></span><br><span class="line"><span class="comment">1&gt; 1	| 16 (v3dd(point3+0)point2)</span></span><br><span class="line"><span class="comment">1&gt;v3d::$vftable@point3@:</span></span><br><span class="line"><span class="comment">1&gt;	| -20</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;thunk: this-=8; goto point3::pfunc</span></span><br><span class="line"><span class="comment">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span></span><br><span class="line"><span class="comment">1&gt;          point2      20       4       4 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">*/</span></span><br></pre></td></tr></table></figure>


<h2 id="vbtable"><a href="#vbtable" class="headerlink" title="vbtable"></a>vbtable</h2><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">A</span> &#123;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">funca</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">	<span class="type">int</span> a;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">B</span>&#123;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">funcb</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">C</span>: <span class="keyword">virtual</span> A ,<span class="keyword">virtual</span> B </span><br><span class="line">&#123;</span><br><span class="line">	<span class="type">int</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">	</span><br><span class="line"></span><br><span class="line">	</span><br><span class="line">&#125;</span><br><span class="line"></span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class A	size(8):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| a</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;A::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;A_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;A::funca</span></span><br><span class="line"><span class="comment">1&gt;A::funca this adjustor: 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">1&gt;class B	size(8):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;B::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;B_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;B::funcb</span></span><br><span class="line"><span class="comment">1&gt;B::funcb this adjustor: 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">1&gt;class C	size(24):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vbptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| c</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base A)</span></span><br><span class="line"><span class="comment">1&gt; 8	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;12	| a</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base B)</span></span><br><span class="line"><span class="comment">1&gt;16	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;20	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;C::$vbtable@:</span></span><br><span class="line"><span class="comment">1&gt; 0	| 0</span></span><br><span class="line"><span class="comment">1&gt; 1	| 8 (Cd(C+0)A)</span></span><br><span class="line"><span class="comment">1&gt; 2	| 16 (Cd(C+0)B)</span></span><br><span class="line"><span class="comment">1&gt;C::$vftable@A@:</span></span><br><span class="line"><span class="comment">1&gt;	| -8</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;A::funca</span></span><br><span class="line"><span class="comment">1&gt;C::$vftable@B@:</span></span><br><span class="line"><span class="comment">1&gt;	| -16</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;B::funcb</span></span><br><span class="line"><span class="comment">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span></span><br><span class="line"><span class="comment">1&gt;               A       8       0       4 0</span></span><br><span class="line"><span class="comment">1&gt;               B      16       0       8 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">*/</span></span><br></pre></td></tr></table></figure>

