<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  
  <title>Category: note | daidai</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta name="description" content="虚拟继承状态下，base  class 不管在继承串联中被派生多少次，永远只会存在一个实例 virtual base class 运用形式 ： 一个抽象的virtual base class 没有任何data member用作接口 类中有vbptr ,指向 vbtable , vbtable 中存放对应的偏移量 1234567891011121314151617181920212223242526">
<meta property="og:type" content="article">
<meta property="og:title" content="daidai">
<meta property="og:url" content="http://example.com/2023/05/c068a3212937.html">
<meta property="og:site_name" content="daidai">
<meta property="og:description" content="虚拟继承状态下，base  class 不管在继承串联中被派生多少次，永远只会存在一个实例 virtual base class 运用形式 ： 一个抽象的virtual base class 没有任何data member用作接口 类中有vbptr ,指向 vbtable , vbtable 中存放对应的偏移量 1234567891011121314151617181920212223242526">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2023-05-03T10:05:17.231Z">
<meta property="article:modified_time" content="2023-05-03T10:25:37.354Z">
<meta property="article:author" content="daidai">
<meta name="twitter:card" content="summary">
  
    <link rel="alternate" href="/atom.xml" title="daidai" type="application/atom+xml">
  
  
    <link rel="shortcut icon" href="/favicon.png">
  
  
    
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/typeface-source-code-pro@0.0.71/index.min.css">

  
  
<link rel="stylesheet" href="/css/style.css">


<figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#<span class="keyword">include</span><span class="string">&lt;bits/stdc++.h&gt;</span></span></span><br><span class="line"><span class="keyword">using</span> <span class="keyword">namespace</span>  std;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">point2</span> &#123;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">pfunc</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">    <span class="type">int</span> a, b;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class point2	size(12):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| a</span></span><br><span class="line"><span class="comment">1&gt; 8	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;point2::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;point2_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point2::pfunc</span></span><br><span class="line"><span class="comment">1&gt;point2::pfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">point3</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> point2</span><br><span class="line">&#123;</span><br><span class="line">    <span class="function"><span class="type">void</span> <span class="title">pfunc</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;</span><br><span class="line">    <span class="type">int</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class point3	size(20):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vbptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| c</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base point2)</span></span><br><span class="line"><span class="comment">1&gt; 8	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;12	| a</span></span><br><span class="line"><span class="comment">1&gt;16	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;point3::$vbtable@:</span></span><br><span class="line"><span class="comment">1&gt; 0	| 0</span></span><br><span class="line"><span class="comment">1&gt; 1	| 8 (point3d(point3+0)point2)</span></span><br><span class="line"><span class="comment">1&gt;point3::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| -8</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;point3::pfunc</span></span><br><span class="line"><span class="comment">1&gt;point3::pfunc this adjustor: 8</span></span><br><span class="line"><span class="comment">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span></span><br><span class="line"><span class="comment">1&gt;          point2       8       0       4 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">vertex</span> &#123;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">vfunc</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class vertex	size(4):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;vertex::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;vertex_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;vertex::vfunc</span></span><br><span class="line"><span class="comment">1&gt;vertex::vfunc this adjustor: 0</span></span><br><span class="line"><span class="comment">*/</span></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">v3d</span> : <span class="keyword">public</span> point3, <span class="keyword">public</span> vertex &#123;</span><br><span class="line">    <span class="type">int</span> d, f;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">    <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class v3d	size(32):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| +--- (base class vertex)</span></span><br><span class="line"><span class="comment">1&gt; 0	| | &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt; 4	| +--- (base class point3)</span></span><br><span class="line"><span class="comment">1&gt; 4	| | &#123;vbptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 8	| | c</span></span><br><span class="line"><span class="comment">1&gt;	| +---</span></span><br><span class="line"><span class="comment">1&gt;12	| d</span></span><br><span class="line"><span class="comment">1&gt;16	| f</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base point2)</span></span><br><span class="line"><span class="comment">1&gt;20	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;24	| a</span></span><br><span class="line"><span class="comment">1&gt;28	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">1&gt;v3d::$vftable@vertex@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;v3d_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;vertex::vfunc</span></span><br><span class="line"><span class="comment">1&gt;v3d::$vbtable@:</span></span><br><span class="line"><span class="comment">1&gt; 0	| 0</span></span><br><span class="line"><span class="comment">1&gt; 1	| 16 (v3dd(point3+0)point2)</span></span><br><span class="line"><span class="comment">1&gt;v3d::$vftable@point3@:</span></span><br><span class="line"><span class="comment">1&gt;	| -20</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;thunk: this-=8; goto point3::pfunc</span></span><br><span class="line"><span class="comment">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span></span><br><span class="line"><span class="comment">1&gt;          point2      20       4       4 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">*/</span></span><br></pre></td></tr></table></figure>


<h2 id="vbtable"><a href="#vbtable" class="headerlink" title="vbtable"></a>vbtable</h2><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">A</span> &#123;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">funca</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">	<span class="type">int</span> a;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">B</span>&#123;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">funcb</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">C</span>: <span class="keyword">virtual</span> A ,<span class="keyword">virtual</span> B </span><br><span class="line">&#123;</span><br><span class="line">	<span class="type">int</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">	</span><br><span class="line"></span><br><span class="line">	</span><br><span class="line">&#125;</span><br><span class="line"></span><br><span class="line"><span class="comment">/*</span></span><br><span class="line"><span class="comment">1&gt;class A	size(8):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| a</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;A::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;A_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;A::funca</span></span><br><span class="line"><span class="comment">1&gt;A::funca this adjustor: 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">1&gt;class B	size(8):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;B::$vftable@:</span></span><br><span class="line"><span class="comment">1&gt;	| &amp;B_meta</span></span><br><span class="line"><span class="comment">1&gt;	|  0</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;B::funcb</span></span><br><span class="line"><span class="comment">1&gt;B::funcb this adjustor: 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">1&gt;class C	size(24):</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt; 0	| &#123;vbptr&#125;</span></span><br><span class="line"><span class="comment">1&gt; 4	| c</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base A)</span></span><br><span class="line"><span class="comment">1&gt; 8	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;12	| a</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;	+--- (virtual base B)</span></span><br><span class="line"><span class="comment">1&gt;16	| &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">1&gt;20	| b</span></span><br><span class="line"><span class="comment">1&gt;	+---</span></span><br><span class="line"><span class="comment">1&gt;C::$vbtable@:</span></span><br><span class="line"><span class="comment">1&gt; 0	| 0</span></span><br><span class="line"><span class="comment">1&gt; 1	| 8 (Cd(C+0)A)</span></span><br><span class="line"><span class="comment">1&gt; 2	| 16 (Cd(C+0)B)</span></span><br><span class="line"><span class="comment">1&gt;C::$vftable@A@:</span></span><br><span class="line"><span class="comment">1&gt;	| -8</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;A::funca</span></span><br><span class="line"><span class="comment">1&gt;C::$vftable@B@:</span></span><br><span class="line"><span class="comment">1&gt;	| -16</span></span><br><span class="line"><span class="comment">1&gt; 0	| &amp;B::funcb</span></span><br><span class="line"><span class="comment">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span></span><br><span class="line"><span class="comment">1&gt;               A       8       0       4 0</span></span><br><span class="line"><span class="comment">1&gt;               B      16       0       8 0</span></span><br><span class="line"><span class="comment"></span></span><br><span class="line"><span class="comment">*/</span></span><br></pre></td></tr></table></figure>

